# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [4,5, 8,10, 22,18] # P2/4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P   5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]               # [c=channels,module,kernlsize,strides]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2           [c=3,64*0.5=32,3]
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],#2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],#4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [256]],#6
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [512]], #8
   [ -1, 1, SPPF, [ 1024,5 ] ], #9
   [-1, 1, CBAM, [1024]], #10
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],#11
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 1, QPixelShuffleUp, [256]],#12
   [[-1, 6], 1, Concat, [1]],  # 13 cat backbone P4
   [-1, 3, C3, [512, False]],  # 14

   [-1, 1, Conv, [256, 1, 1]],#15
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 1, QPixelShuffleUp, [128]],#16
   [[-1, 4], 1, Concat, [1]],  #17 cat backbone P3

   #add start
   [ -1, 3, C3, [ 256, False ] ],  # 18
   [ -1, 1, Conv, [ 128, 1, 1 ] ], #19
   [ -1, 1, QPixelShuffleUp, [64] ],#20
   [ [ -1, 2 ], 1, Concat, [ 1 ] ],  #21 cat backbone P3


   [ -1, 3, C3, [ 128, False ] ],  # 22 (P4/4-minium)

   [ -1, 1, Conv, [ 128, 3, 2 ] ],#23
   [ [ -1, 19 ], 1, Concat, [ 1 ] ],  #24 cat head P3
   #add end

   [-1, 3, C3, [256, False]],  # 25 (P3/8-small)
   [-1, 1, CBAM, [256,7]],#26

   [-1, 1, Conv, [256, 3, 2]],#27
   [[-1, 15], 1, Concat, [1]],  # 28cat head P4
   [-1, 3, C3, [512, False]],  # 29 (P4/16-medium)       [256, 256, 1, False]
   [-1, 1, CBAM, [512,7]],#30

   [-1, 1, Conv, [512, 3, 2]],    #31                       #[256, 256, 3, 2]
   [[-1, 11], 1, Concat, [1]],  # 32cat head P5
   [-1, 3, C3, [1024, False]],  # 33 (P5/32-large)       [512, 512, 1, False]
   [-1, 1, CBAM, [1024,7]],#34

   [[22,26,30,34], 1, ASFF_Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
